@extends('layouts.sapp')

@section('content')
<div class="px-4 py-5 my-5 text-center">
    <div>
        <svg id="logo" width="182" height="120" viewBox="0 0 67 53" fill="#81CB80" xmlns="http://www.w3.org/2000/svg">
            <path d="M1.80411 21.8597C1.80411 30.6204 7.07572 30.4108 18.185 30.287V22.4038C12.5832 22.2633 9.96949 22.9128 9.96949 19.0677V15.4434C9.96949 10.2156 9.303 9.81951 16.5831 9.81951H56.0727L63.0493 1.85126H13.6608C1.04881 1.85126 1.80411 4.39614 1.80411 14.1772V21.8597Z" stroke="#81CB80" stroke-width="1.5"/>
            <path d="M65.0407 31.0354C65.0407 22.2746 59.7691 22.4842 48.6599 22.608V30.4912C54.2616 30.6317 56.8753 29.9823 56.8753 33.8273V37.4516C56.8753 42.6794 57.5418 43.0755 50.2617 43.0755H10.7721L3.79547 51.0438H53.184C65.796 51.0438 65.0407 48.4989 65.0407 38.7178V31.0354Z" stroke="#81CB80" stroke-width="1.5"/>
            <path d="M30.48 32.4987H31.23V31.7487V28.6523C31.23 28.2491 31.3459 28.0685 31.4711 27.9661C31.6251 27.8401 31.9397 27.7133 32.5448 27.7133H36.6744C38.5203 27.7133 40.044 27.3368 41.1153 26.4557C42.2146 25.5516 42.7103 24.2235 42.7103 22.6159V19.7072C42.7103 17.997 42.164 16.5965 40.9714 15.6484C39.8116 14.7264
            38.1578 14.3282 36.1376 14.3282H24.8845H22.3686L24.4738 15.7058L27.9151 17.9577L28.1022 18.0802H28.3258H35.5182C36.6078 18.0802 37.2861 18.3019 37.6816 18.619C38.0454 18.9107 38.2783 19.3717 38.2783 20.1451V22.4908C38.2783 23.1856 38.0731 23.5851 37.7691 23.8335C37.4361 24.1056 36.853 24.3055 35.8898 24.3055H31.595C30.1428
            24.3055 28.9159 24.5823 28.0393 25.2595C27.126 25.965 26.7154 27.0075 26.7154 28.2457V31.7487V32.4987H27.4654H30.48ZM31.23 35.9553V35.2053H30.48H27.4654H26.7154V35.9553V37.9101V38.6601H27.4654H30.48H31.23V37.9101V35.9553Z" stroke="#81CB80" stroke-width="1"/>
        </svg>
    </div>
    <h1 class="display-5 fw-bold" style="color:#81CB80;">سوابلي</h1>
    <div class="col-lg-6 mx-auto">
      <p class="lead mb-4 fs-20">
        الموقع دا عشان اي حد فينا عندو اي حاجة ركنها على جنب و زهقان منها , فيروح عامل ايه , منزلها هنا ممكن يكون حد تاني عاوزها
        و يكون عندو حاجة انته عاوزها , يعني ببساطة الموقع لتبدل الغرض الي مش عاوزو بغرض عاوزو او غرض تاني احسن منو
      </p>
      <div class="d-grid gap-2 d-sm-flex justify-content-sm-center mt-4">
        <a class="link-text" href="{{ route('login') }}">
            <button type="button" class="btn btn-outline-success btn-lg px-1 me-sm-2">تسجيل دخول</button>
        </a>

        @if (Route::has('register'))
            <a class="link-text" href="{{ route('register') }}">
                <button type="button" class="btn btn-outline-success btn-lg  px-4 "> اشتراك</button>
            </a>
        @endif
      </div>
    </div>
  </div>
@endsection